import json  # Импорт модуля JSON (стандарт) для работы с транспортным форматом данных, вместо модуля pickle (библиотекак python)

def run():  # Осуществление функции ввода кв. матрицы и сохранение в файл
    try:
        # Запрашиваем у пользователя размерность матрицы
        n = int(input("Введите размерность n: "))
    except ValueError:
        # Обработка возможной ошибки ввода (введено не целое число)
        print("Ошибка: введите целое число.")
        return False  # Прерываем функцию, если формат некорректный

    if n <= 0:  # Если размерность меньше нуля, выводим ошибку и прерываем ф-ю
        print("Ошибка. n <= 0. Повторите попытку.")  
        return False
        
    print("Введите элементы квадратной матрицы:")
    matrix = []  # Пустой список для будущей матрицы

    # Двойной цикл для последовательного заполнения строк и столбцов
    for i in range(n):
        matrix.append([])   # В список матрицы добавляем новую пустую строку 
        for j in range(n):
            try:
                num = float(input(f"Элемент [{i}][{j}]: "))  # Запрашиваем эл-т матрицы; переводим его в число с пл.точкой
                matrix[i].append(num)  # Добавляем эл-т в текущую строку
            except ValueError:
                # Обработка ошибки, если введенный эл-т не является числом
                print("Ошибка: некорректный формат. Сброс ввода.")
                return False  # Прерываем функцию, если формат некорректный
                
    # Транспортный протокол: сохраняем матрицу в текстовый JSON-формат
    try:
        # Открываем файл matrix.json в режиме записи текстовых данных
        with open("matrix.json", "w", encoding="utf-8") as f:
            json.dump(matrix, f, indent=4)  # Записываем структуру матрицы в JSON с отступами
        print("[Модуль ввода] Матрица успешно записана в транспортный файл matrix.json")
        return True # Успешное завершение работы ф-и
    except IOError: # Обработка ошибок I/O (например, нет прав на запись на диск)
        print("[Ошибка взаимодействия] Не удалось записать файл матрицы на диск.")
        return False # Возвращаем false в случае ошибки записи

