import input_module   # Импорт модуля ввода данных матрицы
import process_module # Импорт модуля математ. обработки матрицы
import output_module  # Импорт модуля форматированного вывода рез-ов

def main(): # Глав. управляющая ф-я приложения (Т-образный диспетчер)
    print("=== Старт интегрированной системы (Т-образная структура) ===")
    
    # Организация глобального жизненного цикла программы
    while True:
        # 1. Вызов подчинённого модуля ввода
        if not input_module.run():
            print("Повторите попытку ввода заново.\n")
            continue # Возврат в начало цикла при ошибке ввода
            
        # 2. Вызов подчинённого модуля обработки данных
        if not process_module.run():
            print("Сбой на этапе обработки данных.\n")
            continue # Возврат в начало цикла при ошибке обработки
            
        # 3. Вызов подчинённого модуля вывода результатов
        if not output_module.run():
            print("Сбой на этапе вывода данных.\n")
            continue # Возврат в начало цикла при ошибке вывода
        
        # Управление главным циклом программы (Интерфейс координатора)
        nextt = input("Продолжить работу? (да/нет): ").strip()
        if nextt.lower() == "нет":
            print("Выход из программы. Работа завершена.")
            break # Прерывание бесконечного цикла и закрытие программы
        else:
            print("\nПодготовка к работе с новой матрицей ...")

if __name__ == "__main__":
    main() # Вход в программу. Запуск диспетчера при прямом вызове файла
