import json  # Импорт модуля для десериализации и сериализации текстовых JSON-объектов

def run(): # Ф-я математической обработки: чтение JSON, расчёт нулей и запись результатов
    # Транспортный протокол: читаем данные из текстового JSON-файла с обработкой возможных ошибок
    try:
        # Открываем файл matrix.json в реж. чтения текста
        with open("matrix.json", "r", encoding="utf-8") as f:
            matrix = json.load(f)  # Считываем и восстанавливаем JSON-массив в список Python
    except (FileNotFoundError, json.JSONDecodeError, IOError):
        # Вывод ошибки, если файл не найден, поврежден, недоступен
        print("[Ошибка взаимодействия] Файл matrix.json отсутствует или поврежден. Осуществление расчёта невозможно.")
        return False  # Прерываем функцию, возвращая false

    n = len(matrix)  # Определяем размерность кв. матрицы (кол-во строк)

    # Инициализация счётчиков нулей для 4-х областей матрицы
    above_main = below_main = above_side = below_side = 0

    # Двойной цикл для обхода каждого эл-та матрицы
    for i in range(n):
        for j in range(n):
            if matrix[i][j] == 0:  # Проверка, равен ли эл-т нулю
                # Проверка относительно глав. диагонали
                if i < j:
                    above_main += 1  # Элемент строго выше глав. диагонали
                elif i > j:
                    below_main += 1  # Элемент строго ниже глав. диагонали

                # Проверка относительно побоч. диагонали
                if i + j < n - 1:
                    above_side += 1  # Элемент строго выше побоч. диагонали
                elif i + j > n - 1:
                    below_side += 1  # Элемент строго ниже побоч. диагонали

    # Сопоставление объектов (Mapping полей): переводим внутренние счетчики в поля транспортного протокола
    results = {
        "aboveMainZerosCount": above_main,
        "belowMainZerosCount": below_main,
        "aboveSideZerosCount": above_side,
        "belowSideZerosCount": below_side
    }
    
    # Транспортный протокол: сохраняем рез-ты вычислений в новый JSON-файл
    try:
        # Открываем файл results.json в реж. записи текста
        with open("results.json", "w", encoding="utf-8") as f:
            json.dump(results, f, indent=4)  # Записываем структурированный словарь с рез-ми в файл
        print("[Модуль обработки] Расчеты завершены. Данные сохранены в results.json")
        return True  # Успешное завершение работы ф-и
    except IOError:
        # Обработка ошибок I/O при попытке сохранения рез-в
        print("[Ошибка взаимодействия] Ошибка ввода-вывода при сохранении результатов.")
        return False  # Прерываем функцию, возвращая false
